app/Models/echeanceModel.php

SELECT *
FROM `echeance`
WHERE `idTontine` = '10'
---
    function echeancesTontines($idTontine)
    {
        return $this->where('idTontine',$idTontine)
                    ->findAll();