app/Models/TontineModel.php

SELECT *
FROM `tontine`
WHERE `idResponsable` = '2'
---
    function listeTontineResp($idAdherent)
    {
        return $this->where('idResponsable', $idAdherent)
                    ->findAll();

SELECT *
FROM `tontine`
WHERE `tontine`.`id` = '10'
---
    function tontine($idTontine)
    {
        return $this->find($idTontine);